### DataFrame 누락데이터 처리하기
    누락데이터 처리하는 기능 - dropna(), fillna(), isnull(), notnull()

In [1]:
'''
판다스는 누락된 모든 데이터를 NaN으로 처리한다.
dropna() : NaN 값이 하나라도 있으면 해당 row를 삭제
dropna(how='all') : 모두 NaN 값인 row를 삭제
dorpna(how='any') : NaN 값이 하나라도 있으면 해당 row를 삭제(인자값 없는 것과 같음)
dropna(thresh=3) : 누락데이터를 제외한 data가 3개 이상이면 남기겠다.

fillna() : 누락된 데이터를 다른 값으로 채움

isnull()
notnull()
'''

"\n판다스는 누락된 모든 데이터를 NaN으로 처리한다.\ndropna() : NaN 값이 하나라도 있으면 해당 row를 삭제\ndropna(how='all') : 모두 NaN 값인 row를 삭제\ndorpna(how='any') : NaN 값이 하나라도 있으면 해당 row를 삭제(인자값 없는 것과 같음)\ndropna(thresh=3) : 누락데이터를 제외한 data가 3개 이상이면 남기겠다.\n\nfillna() : 누락된 데이터를 다른 값으로 채움\n\nisnull()\nnotnull()\n"

In [2]:
import pandas as pd
from pandas import DataFrame
from numpy import nan as NA #넘파이에서 제공하는 누락데이터
df = DataFrame([[1.2, 6.5, 3], [1, NA, NA], [NA, NA, NA], [NA, 6.5, 3.7]])
df

     0    1    2
0  1.2  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.7

In [3]:
#1. dropna()
removeNa = df.dropna() #누락값이 하나라도 있으면 삭제
df.dropna(how='any') #위와 같음
removeNa

     0    1    2
0  1.2  6.5  3.0

In [4]:
df #원본은 유지한다. 원본에 적용하려면 inplace=True를 해줘야 함.

     0    1    2
0  1.2  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.7

In [5]:
df.dropna(how='all') #모든 데이터가 누락데이터일 때만 삭제

     0    1    2
0  1.2  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.7

In [6]:
df.dropna(thresh=2) #누락데이터를 제외한 데이터가 2개 이상이면 남긴다.

     0    1    2
0  1.2  6.5  3.0
3  NaN  6.5  3.7

In [7]:
df.dropna(thresh=3) #누락데이터를 제외한 데이터가 3개 이상이면 남긴다.

     0    1    2
0  1.2  6.5  3.0

### DataFrame 누락데이터 처리하기
    누락된 값 채우기 - fillna()

In [8]:
df

     0    1    2
0  1.2  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.7

In [9]:
df.fillna(0) #누락데이터를 0으로 채움. 원본은 유지

     0    1    2
0  1.2  6.5  3.0
1  1.0  0.0  0.0
2  0.0  0.0  0.0
3  0.0  6.5  3.7

In [10]:
df.fillna(df.mean()) #누락데이터를 컬럼의 평균으로 채움

     0    1     2
0  1.2  6.5  3.00
1  1.0  6.5  3.35
2  1.1  6.5  3.35
3  1.1  6.5  3.70

In [11]:
df.fillna(value=77) #누락데이터를 내가 원하는 값으로 채움

      0     1     2
0   1.2   6.5   3.0
1   1.0  77.0  77.0
2  77.0  77.0  77.0
3  77.0   6.5   3.7

In [12]:
df.fillna(77)

      0     1     2
0   1.2   6.5   3.0
1   1.0  77.0  77.0
2  77.0  77.0  77.0
3  77.0   6.5   3.7

In [13]:
df.fillna(method='ffill') #이전 컬럼값으로 채움

     0    1    2
0  1.2  6.5  3.0
1  1.0  6.5  3.0
2  1.0  6.5  3.0
3  1.0  6.5  3.7